Revit 2027 API
FaceSilhouetteNode.GetFace Method
 Returns the Face object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Face GetFace()
Public Function GetFace As Face
public:
Face^ GetFace()
member GetFace : unit -> Face
Return Value
Face
 The face.
See Also
Reference
FaceSilhouetteNode Class
Autodesk.Revit.DB Namespace